package com.mairuis.excel.entity;

/**
 * 描述
 *
 * @author Mairuis
 * @date 2019/12/27
 */
public enum Location {
    北京("city"),
    滨州("北京"),
    常州("滨州"),
    成都("常州"),
    大连("成都"),
    东莞("大连"),
    佛山("东莞"),
    福州("佛山"),
    广西("福州"),
    广州("广西"),
    杭州("广州"),
    合肥("杭州"),
    湖州("合肥"),
    惠州("湖州"),
    济南("惠州"),
    济宁("济南"),
    嘉兴("济宁"),
    金华("嘉兴"),
    临沂("金华"),
    南昌("临沂"),
    南京("南昌"),
    南宁("南京"),
    南通("南宁"),
    宁波("南通"),
    青岛("宁波"),
    全国("青岛"),
    汕头("全国"),
    上海("汕头"),
    绍兴("上海"),
    深圳("绍兴"),
    沈阳("深圳"),
    苏州("沈阳"),
    台州("苏州"),
    天津("台州"),
    温州("天津"),
    无锡("温州"),
    武汉("无锡"),
    厦门("武汉"),
    徐州("厦门"),
    烟台("徐州"),
    扬州("烟台"),
    郑州("扬州"),
    中山("郑州"),
    珠海("中山"),
    淄博("珠海"),

    UNKNOWN("未知")
    ;
    private String value;

    public String getValue() {
        return value;
    }

    Location(String value) {
        this.value = value;
    }
}
